export default {
  title: 'Кіру',
  signInContinue: 'Кіру арқылы жалғастыру',
  haveIssues: 'Егер кіру мәселелеріңіз болса, рахмет.',
  buttons: {
    mobileSignIn: 'Мобиль нөмірмен кіру',
    emailSignIn: 'Электронды пошта арқылы кіру',
    continue: 'Жалғастыру',
    forgotPassword: 'Құпия сөзді ұмыттыңыз ба?',
    agree: 'Келісім алып жалғау',
    cancel: 'Болдырмау',
    confirm: 'Растау',
    backToSignIn: 'Кіруге қайтару',
    resendCode: 'Кодты қайта жіберу',
    resendCodeIn: '{{time}} секундтан кейін кодты қайта жіберу',
    retry: 'Қайталау',
    logout: 'Шығу',
  },
  email: {
    description: 'Электронды пошта және құпия сөзіңізді енгізіңіз',
    label: 'Электронды пошта',
    input: {
      required: 'Электронды пошта міндетті',
      valid: 'Электронды пошта қате',
    },
  },
  password: {
    label: 'Құпия сөз',
    input: {
      required: 'Құпия сөз міндетті',
      valid: 'Құпия сөз 8-50 таңбадан тұруы керек, бір санды, бір үлкен әріпті, бір кіші әріпті қамтиды',
    },
  },
  confirmPassword: {
    label: 'Құпия сөзді растау',
    input: {
      required: 'Құпия сөзді растау міндетті',
      match: 'Құпия сөздер сәйкес келмейді',
    },
  },
  mobile: {
    description: 'Мобиль нөміріңізді және құпия сөзіңізді енгізіңіз',
    label: 'Мобиль нөмір',
    searchPlaceholder: 'Мобиль нөміріңіздің елін іздеу',
    input: {
      required: 'Мобиль нөмір міндетті',
      valid: 'Мобиль нөмір қате',
    },
  },
  termsAndPrivacy: {
    title: '{{name}} Жұмыс шарттары мен Құпиялылық саясатын бақылау және келісу',
    description: 'Қолдану үшін, сізге жұмыс шарттары мен Құпиялылық саясатын бақылау және келісу қажет',
    terms: 'Жұмыс шарттары',
    privacy: 'Құпиялылық саясаты',
  },
  passwordRecovery: {
    title: 'Құпия сөзді қалпына келтіру',
    enterEmail: 'Электронды поштаңызды енгізіңіз',
    enterMobileNumber: 'Мобиль нөміріңізді енгізіңіз',
    emailInfo:
      'Егер электронды поштаның расталатын болса, сізге құпия сөзіңізді қалпына келтіру коды бар электронды поштаныңызға жіберіледі',
    mobileInfo: 'Егер мобиль нөміріңіз расталатын болса, сізге құпия сөзіңізді қалпына келтіру үшін код бар хабарлама жіберіледі',
    enterPassword: 'Сіздің жаңа құпия сөзіңізді орналастыру үшін жаңа құпия сөзіңізді екі рет енгізіңіз',
  },
  passwordChanged: {
    title: 'Құпия сөз сәтті сөзделді',
    description: 'Құпия сөзіңізді сәтті сөздеген соң, сіз өз акаунтыңызға кіруге қайтарыласыз',
  },
  authenticationCode: {
    title: 'Аутентификация кодын енгізіңіз',
    descriptionEmail: 'Электрондық пошта арқылы жіберілген {{count}}-орынды кодты енгізіңіз',
    descriptionMobile: 'Телефон нөмірі арқылы жіберілген {{count}}-орынды кодты енгізіңіз',
    wrongCode: 'Енгізілген код дұрыс емес немесе мерзімі өткен. Қайталап көріңіз.',
    emailHeader: 'Электрондық поштаға өзгерту',
    mobileHeader: 'Телефон нөмірін өзгерту',
  },
  organisationList: {
    title: 'Ұйымдар тізімі',
    description: 'Көретін ұйымды таңдаңыз',
    error: {
      title: 'Ұйымдарды алу қатесі',
      description: 'Кешіріңіз, бірақ қазір ұйымдар тізімін алу мәселесі шешілуде кеңестерге қатысамыз.',
    },
  },
  userBlocked: {
    blocked: {
      title: 'Кіру блокталған',
      description: 'Сіздің тіркелгіңіз блокталды. Қосымша көмек қажет болса, кеңестермен хабарласыңыз.',
    },
    created: {
      title: 'Тексеру қажет',
      description: 'Сіздің тіркелгіңіз әлі тексерілмеген. Қосымша көмек қажет болса, кеңестермен хабарласыңыз.',
    },
    nonEmployee: {
      title: 'Жұмысшы емес',
      description: 'Сіз ұйымдың қызметкері емесіз. Қосымша көмек қажет болса, кеңестермен хабарласыңыз.',
    },
  },
  errors: {
    requestResetPassword: 'Құпия сөзді қалпына келтіру әрекеті кезінде қате пайда болды. Кейінірек қайталап көріңіз.',
    verifyResetPasswordCode: 'Құпия сөзді қалпына келтіру кодын тексеру кезінде қате пайда болды. Кейінірек қайталап көріңіз.',
    setNewPassword: 'Жаңа құпия сөзді орнату әрекеті кезінде қате пайда болды. Кейінірек қайталап көріңіз.',
    login: 'Кіру әрекеті кезінде қате пайда болды. Кейінірек қайталап көріңіз.',
    mobileCredentials: 'Телефон нөмірі немесе құпия сөз дұрыс емес',
    emailCredentials: 'Электрондық пошта немесе құпия сөз дұрыс емес',
    fetchOrganisations: 'Ұйымдарды алу әрекеті кезінде қате пайда болды. Кейінірек қайталап көріңіз.',
  },
};
